docs: optimize README
